Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_gateway_response.default_4xx_cors will be updated in-place
~ resource "aws_api_gateway_gateway_response" "default_4xx_cors" {
        id                  = "aggr-70paytfqfb-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_gateway_response.default_5xx_cors will be updated in-place
~ resource "aws_api_gateway_gateway_response" "default_5xx_cors" {
        id                  = "aggr-70paytfqfb-DEFAULT_5XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role_policy.step_functions_eventbridge will be created
+ resource "aws_iam_role_policy" "step_functions_eventbridge" {
      + id          = (known after apply)
      + name        = "StepFunctionsEventBridgeIntegration"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "events:PutRule",
                          + "events:DescribeRule",
                          + "events:DeleteRule",
                          + "events:PutTargets",
                          + "events:RemoveTargets",
                          + "events:TagResource",
                          + "events:EnableRule",
                          + "events:DisableRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "sharedservices_step_functions_role"
    }

  # aws_iam_role_policy.step_functions_policy will be updated in-place
~ resource "aws_iam_role_policy" "step_functions_policy" {
        id          = "sharedservices_step_functions_role:sharedservices_step_functions_policy"
        name        = "sharedservices_step_functions_policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "lambda:InvokeFunction",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:lambda:us-east-2:825765422855:function:get_logo",
                            "arn:aws:lambda:us-east-2:825765422855:function:delete_logo",
                            "arn:aws:lambda:us-east-2:825765422855:function:notify_post",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                          - "ecs:RunTask",
                          - "ecs:StopTask",
                          - "ecs:DescribeTasks",
                          + "logs:CreateLogDelivery",
                          + "logs:GetLogDelivery",
                          + "logs:UpdateLogDelivery",
                          + "logs:DeleteLogDelivery",
                          + "logs:ListLogDeliveries",
                          + "logs:PutResourcePolicy",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                        ]
                      ~ Resource = [
                          - "arn:aws:ecs:us-east-2:825765422855:task-definition/render_video:5",
                          - "arn:aws:ecs:us-east-2:825765422855:task-definition/weekly_news_recap:4",
                        ] -> "*"
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action   = [
                          + "events:PutRule",
                          + "events:PutTargets",
                          + "events:DescribeRule",
                          + "events:RemoveTargets",
                          + "events:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:*:*:rule/StepFunctionsGetEventsForECSTaskRule*"
                    },
                  + {
                      + Action   = [
                          + "ecs:RunTask",
                          + "ecs:StopTask",
                          + "ecs:DescribeTasks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:us-east-2:825765422855:task-definition/render_video:5"
                    },
                    {
                        Action    = "iam:PassRole"
                        Condition = {
                            StringEquals = {
                                "iam:PassedToService" = "ecs-tasks.amazonaws.com"
                            }
                        }
                        Effect    = "Allow"
                        Resource  = [
                            "arn:aws:iam::825765422855:role/sharedservices_ecs_exec_role",
                            "arn:aws:iam::825765422855:role/sharedservices_ecs_task_role",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_iam_service_linked_role.step_functions will be created
+ resource "aws_iam_service_linked_role" "step_functions" {
      + arn              = (known after apply)
      + aws_service_name = "states.amazonaws.com"
      + create_date      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + unique_id        = (known after apply)
    }

  # aws_sfn_state_machine.weekly_recap will be updated in-place
~ resource "aws_sfn_state_machine" "weekly_recap" {
      ~ definition                = jsonencode(
          ~ {
              ~ States  = {
                  ~ RunWeeklyRecap = {
                      ~ Parameters = {
                          ~ TaskDefinition       = "arn:aws:ecs:us-east-2:825765422855:task-definition/weekly_news_recap:3" -> "arn:aws:ecs:us-east-2:825765422855:task-definition/weekly_news_recap:4"
                            # (4 unchanged attributes hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                }
                # (2 unchanged attributes hidden)
            }
        )
        id                        = "arn:aws:states:us-east-2:825765422855:stateMachine:weekly_news_recap"
        name                      = "weekly_news_recap"
        tags                      = {}
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 4 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 2 to add, 4 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```